#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
azurerm_resource_group.this: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01YTQwYjI3NC02NmM2LTQ4MTgtYTdlMS02Y2E3ODY3MDEyNTg7b2JqZWN0SWQ9ODY0YzYxYzAtZTAwMi00MzIwLTlhZWEtYWEyMWZkMjVhOTAzO3N1YnNjcmlwdGlvbklkPTJkOTllYTk3LWUwN2MtNDEyMy1hMzRjLTI1Nzg3NTMxZTVhOTt0ZW5hbnRJZD1hYzJmZmQ3Yy1kYTg1LTQ3NjUtYWY4NC0xZjE0MTcxNzNiOTQ=]
azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet]
azurerm_subnet.app: Refreshing state... [id=/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "pappu-dev-kv"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = true
      + resource_group_name           = "pappu"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
      + tenant_id                     = "ac2ffd7c-da85-4765-af84-1f1417173b94"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = [
              + "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app",
            ]
        }
    }

  # azurerm_storage_account.pdf will be created
  + resource "azurerm_storage_account" "pdf" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "pappudevpdfsa"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "pappu"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = [
              + "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app",
            ]
        }
    }

  # azurerm_storage_container.pdf_uploads will be created
  + resource "azurerm_storage_container" "pdf_uploads" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "pdf-uploads"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "pappudevpdfsa"
    }

  # azurerm_subnet.app will be updated in-place
  ~ resource "azurerm_subnet" "app" {
        id                                            = "/subscriptions/2d99ea97-e07c-4123-a34c-25787531e5a9/resourceGroups/pappu/providers/Microsoft.Network/virtualNetworks/pappu-dev-vnet/subnets/pappu-dev-subnet-app"
        name                                          = "pappu-dev-subnet-app"
      ~ service_endpoints                             = [
          + "Microsoft.Storage",
        ]
        # (7 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + storage_account_blob_endpoint = (known after apply)

Warning: Argument is deprecated

  with azurerm_storage_container.pdf_uploads,
  on main.tf line 59, in resource "azurerm_storage_container" "pdf_uploads":
  59:   storage_account_name  = azurerm_storage_account.pdf.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sreedath19, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*